{
"Intro":[{
"Title":"How a Sword is Forged",
"History": "Blacksmithing is an ancient art in which metal is heated and crafted into tools, weapons and/or art. It is a form of metalsmithing. Blacksmiths create objects from wrought iron or steel by heating it until it is soft enough to work into different shapes and creations.",

"Composition":"What are they usually made of? Iron is typically used when forging a sword due to its various properties. Iron is harder than most substances, yet is not brittle like stone, can handle high temperatures and after applying adequate heat, it is relatively easy to shape it into different forms. As an added bonus, iron is pretty abundant and makes up 5% of the earth's crust  and is easy to come by.",
}],

"Planning":[{
"Design":"Design The Blade Blacksmithing is a form of engineering, and as such, the design process must be incorporated. Before the forging process begins, the desired blade must be designed and planned out before hand to ensure a quality product. The blade dimensions, material, and purpose need to be decided beforehand. In its essence a sword is a sharpened piece of metal with a handle and is usually 24 to 48 inches in length. The tip is usually tapered to a point. The design of the blade determines the forging process and blade material. If you were creating a slim blade like a rapier, it would need to be flexible, and if you were ,making a broadsword, it would need to focus on hardness and strength. There is a vast amount of blade styles that can be used, and each has a certain forge technique that would work best for its specific needs; a blacksmith must keep this in mind.",

"cMetal":"Choose a Metal/Alloy Iron is alloyed with carbon to create steel. The right amount of carbon is needed to make the stee hard enough to take an edge and hold it, however, if too much carbon is added, the metal will be hard and brittle. You want your steel to be hard, but not brittle, flexible, but not weak. A blacksmith can use regular steel to craft the sword, but could also use another metal/s in the steel alloy if they want the blade to have a specific characteristics. Other metals like chromium or copper can be added to the steel alloy to create these specific characteristics. For example, stainless steel is steel that has at least 10.5 percent chromium content. Chromium creates a thin layer of oxide on the surface of the blade. This layer of oxide, called the passive layer, prevents corrosion of the steel. Steel alloys are commonly used in creating a blade.",



}]
}
